Управление_торговлей.ПБТ/src/Documents/РазбивкаПоДням/РазбивкаПоДням.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РазбивкаПоДням</name>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.вт_ЗаказВПроизводство</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>Номенклатура</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПриоритетное</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Колич1</name>
      <comment>Пн</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Колич2</name>
      <comment>Вт</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Колич3</name>
      <comment>Ср</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Колич4</name>
      <comment>Чт</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Колич5</name>
      <comment>Пт</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Итого</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗаказаМесячный</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <comment>(Общ) </comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийСтр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Разница</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Рецепт</name>
      <type>
        <types>CatalogRef.вт_ВариантыПроизводстваПоТехКартам</types>
      </type>
    </attributes>
    <attributes>
      <name>Линия</name>
      <type>
        <types>CatalogRef.Линии</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сводно</name>
    <attributes>
      <name>Номенклатура</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПриоритетное</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗаказаМесячный</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуемаяДатаПроизводства</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийПроизводства</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СырьеНаПроверке</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТоварыВПути</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Итого</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Разница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопЗаказ</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей.ПБТ/src/Documents/РазбивкаПоДням/Forms/ФормаДокумента/Module.bsl
&НаСервере
Функция ПечатьРДНаСервере()
	Возврат Документы.РазбивкаПоДням.ПечатьРД(Объект);
КонецФункции

&НаКлиенте
Процедура ПечатьРД(Команда)
	ТабДок = ПечатьРДНаСервере();
	ТабДок.Показать();
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияКолич1ПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Продукция.ТекущиеДанные;
	ПересчетСтрокиНаКлиенте(ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ПересчетСтрокиНаКлиенте(ТекущаяСтрока)
	ТекущаяСтрока.Итого = ТекущаяСтрока.Колич1+ТекущаяСтрока.Колич2+ТекущаяСтрока.Колич3+ТекущаяСтрока.Колич4+ТекущаяСтрока.Колич5;
	ТекущаяСтрока.Разница = ТекущаяСтрока.Итого-ТекущаяСтрока.Количество;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоЗаказуНаПеремещениеНаСервере()
	
	Объект.Продукция.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	вт_ЗаказВПроизводство.Номенклатура КАК Номенклатура,
	               |	вт_ЗаказВПроизводство.Количество КАК Количество,
	               |	вт_ЗаказВПроизводство.КоличествоУпаковок КАК КоличествоУпаковок,
	               |	вт_ЗаказВПроизводство.ВариантПроизводства КАК Рецепт
	               |ИЗ
	               |	Документ.вт_ЗаказВПроизводство.Товары КАК вт_ЗаказВПроизводство
	               |ГДЕ
	               |	вт_ЗаказВПроизводство.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Заказ);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НовСтр = Объект.Продукция.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
		
		НовСтр.Разница = НовСтр.Количество;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоЗаказуНаПеремещение(Команда)
	ЗаполнитьПоЗаказуНаПеремещениеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказНаПеремещениеПриИзменении(Элемент)
	ЗаполнитьПоЗаказуНаПеремещениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;

КонецПроцедуры
